// Задача 10: Напишите программу, которая принимает на вход 
// трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1


// Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());

// int num1 = num /10;
// int res = num1%10;

// Console.WriteLine(res);


// Задача 15: Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет


// Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());

// if (num == 1)
// {
//     Console.WriteLine("нет");
// }
// else if (num == 2)
// {
//     Console.WriteLine("нет");
// }
// else if (num == 3)
// {
//     Console.WriteLine("нет");
// }
// else if (num == 4)
// {
//     Console.WriteLine("нет");
// }else if (num == 5)
// {
//     Console.WriteLine("нет");
// }else if (num == 6)
// {
//     Console.WriteLine("да");
// }
// else if (num == 7)
// {
//     Console.WriteLine("да");
// }else 
// {
//     Console.WriteLine("Такого дня недели нет");
// }



// Задача 13: Напишите программу, которая выводит третью цифру заданного 
// числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6



